XML/Public/GETRECINFO-PBQB01/request_pre/2022年3月1日/body_GETRECINFO-PBQB01_request_pre_20220301203644.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:out="http://outsystem.ats.com.cn">
   <soapenv:Header/>
   <soapenv:Body>
      <out:outSystemWS>
         <out:in0>
         <![CDATA[
            <MBS>
                    <pub>
                    <SRCOUTSYSTEMCODE>NC</SRCOUTSYSTEMCODE>
                    <SRCBATCHNO>temp20210407</SRCBATCHNO>
                    <TRANSCODE>PBQB01</TRANSCODE>
                    <TRANSDATETIME>2021-04-07 08:20:10</TRANSDATETIME>
                    <MD5>158cfd893b0598f078f7efa4e6b11696</MD5>
                    </pub>
                    <req>
                    <head>
                    <COMMANDCODE>GETRECINFO</COMMANDCODE>
                    <PAGEINDEX>1</PAGEINDEX>
                    <PAGESIZE>100</PAGESIZE>
                    </head>
                    <searchconditions>
                    <SRCSERIALNO>P10001_2</SRCSERIALNO>
                    </searchconditions>
                    </req>
            </MBS>
            ]]>
        </out:in0>
      </out:outSystemWS>
   </soapenv:Body>
</soapenv:Envelope>